Revit 2027 API
CurtainSystem.CurtainGrids Property
Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurtainGridSet CurtainGrids { get; }
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
member CurtainGrids : CurtainGridSet with get
Return Value
CurtainGridSet
A CurtainGrid set will be returned if the operation succeeds. null will be returned if the CurtainSystem doesn't include any CurtainGrid.
See Also
Reference
CurtainSystem Class
Autodesk.Revit.DB Namespace